In [53]:
import pandas as pd;

In [54]:
data = pd.DataFrame({
    'name':['vishal', 'om', 'shubz'],
    'age':[21,22,32]
})
data

     name  age
0  vishal   21
1      om   22
2   shubz   32

In [55]:
data.head()

     name  age
0  vishal   21
1      om   22
2   shubz   32

In [57]:
data.tail()

     name  age
0  vishal   21
1      om   22
2   shubz   32

In [58]:
data.size

6

In [59]:
data.shape

(3, 2)

In [60]:
data.info

<bound method DataFrame.info of      name  age
0  vishal   21
1      om   22
2   shubz   32>

In [62]:
data.describe()

             age
count   3.000000
mean   25.000000
std     6.082763
min    21.000000
25%    21.500000
50%    22.000000
75%    27.000000
max    32.000000

In [63]:
data.rename(columns={'name':'Full_name'})

  Full_name  age
0    vishal   21
1        om   22
2     shubz   32

In [64]:
data.to_csv('data1', index=False)

In [65]:
load = pd.read_csv('data1')

In [66]:
load

     name  age
0  vishal   21
1      om   22
2   shubz   32

In [67]:
load['depatment'] = ['cs', 'IT', 'Al']

In [68]:
load

     name  age depatment
0  vishal   21        cs
1      om   22        IT
2   shubz   32        Al

In [69]:
load.drop('depatment', axis=1)

     name  age
0  vishal   21
1      om   22
2   shubz   32

In [70]:
load

     name  age depatment
0  vishal   21        cs
1      om   22        IT
2   shubz   32        Al

In [71]:
load.loc[len(load)] =['mayur', 22, 'cs']

In [72]:
load

     name  age depatment
0  vishal   21        cs
1      om   22        IT
2   shubz   32        Al
3   mayur   22        cs

In [73]:
load.drop(load[load.name == 'vishal'].index)

    name  age depatment
1     om   22        IT
2  shubz   32        Al
3  mayur   22        cs

In [74]:
load.loc[0, 'age'] = 33

In [75]:
load

     name  age depatment
0  vishal   33        cs
1      om   22        IT
2   shubz   32        Al
3   mayur   22        cs

In [76]:
load[['name']]

     name
0  vishal
1      om
2   shubz
3   mayur

In [77]:
load.loc[load.name == 'vishal']

     name  age depatment
0  vishal   33        cs

In [79]:
load

     name  age depatment
0  vishal   33        cs
1      om   22        IT
2   shubz   32        Al
3   mayur   22        cs

In [80]:
load['name'] == 'vishal'

0     True
1    False
2    False
3    False
Name: name, dtype: bool

In [81]:
load[load.name == 'vishal']

     name  age depatment
0  vishal   33        cs

In [82]:
load.where(load.name == 'vishal')

     name   age depatment
0  vishal  33.0        cs
1     NaN   NaN       NaN
2     NaN   NaN       NaN
3     NaN   NaN       NaN